torvalds/linux/drivers/staging/rtl8723au/core/rtw_p2p.c
	/*	WFD Device Information ATTR */
	/*	Type: */
	wfdie[ wfdielen++ ] = WFD_ATTR_DEVICE_INFO;

	/*	Length: */
	/*	Note: In the WFD specification, the size of length field is 2. */
	put_unaligned_be16(0x0006, wfdie + wfdielen);
	wfdielen += 2;

	/*	Value1: */
	/*	WFD device information */
	/*	WFD primary sink + available for WFD session + WiFi Direct mode */

	if (true == pwdinfo->session_available)
	{
		if (P2P_ROLE_GO == pwdinfo->role)
		{
			if (is_any_client_associated(pwdinfo->padapter))
			{
				if (pwdinfo->wfd_tdls_enable)
				{
					/*	TDLS mode + WSD (WFD Service Discovery) */
					put_unaligned_be16(pwfd_info->wfd_device_type | WFD_DEVINFO_WSD | WFD_DEVINFO_PC_TDLS | WFD_DEVINFO_HDCP_SUPPORT, wfdie + wfdielen);
				}
				else
				{
					/*	WiFi Direct mode + WSD (WFD Service Discovery) */
					put_unaligned_be16(pwfd_info->wfd_device_type | WFD_DEVINFO_WSD | WFD_DEVINFO_HDCP_SUPPORT, wfdie + wfdielen);
				}
			}
			else
			{
				if (pwdinfo->wfd_tdls_enable)
				{
					/*	available for WFD session + TDLS mode + WSD (WFD Service Discovery) */
					put_unaligned_be16(pwfd_info->wfd_device_type | WFD_DEVINFO_SESSION_AVAIL | WFD_DEVINFO_WSD | WFD_DEVINFO_PC_TDLS | WFD_DEVINFO_HDCP_SUPPORT, wfdie + wfdielen);
				}
				else
				{
					/*	available for WFD session + WiFi Direct mode + WSD (WFD Service Discovery) */
					put_unaligned_be16(pwfd_info->wfd_device_type | WFD_DEVINFO_SESSION_AVAIL | WFD_DEVINFO_WSD | WFD_DEVINFO_HDCP_SUPPORT, wfdie + wfdielen);
				}
			}
		}
		else
		{
			if (pwdinfo->wfd_tdls_enable)
			{
				/*	available for WFD session + WiFi Direct mode + WSD (WFD Service Discovery) */
				put_unaligned_be16(pwfd_info->wfd_device_type |
						   WFD_DEVINFO_SESSION_AVAIL |
						   WFD_DEVINFO_WSD |
						   WFD_DEVINFO_PC_TDLS |
						   WFD_DEVINFO_HDCP_SUPPORT,
						   wfdie + wfdielen);
			}
			else
			{

				/*	available for WFD session + WiFi Direct mode + WSD (WFD Service Discovery) */
				put_unaligned_be16(pwfd_info->wfd_device_type |
						   WFD_DEVINFO_SESSION_AVAIL |
						   WFD_DEVINFO_WSD |
						   WFD_DEVINFO_HDCP_SUPPORT,
						   wfdie + wfdielen);
			}
		}
	}
	else
	{
		if (pwdinfo->wfd_tdls_enable)
		{
			put_unaligned_be16(pwfd_info->wfd_device_type |
					   WFD_DEVINFO_WSD |
					   WFD_DEVINFO_PC_TDLS |
					   WFD_DEVINFO_HDCP_SUPPORT,
					   wfdie + wfdielen);
		}
		else
		{
			put_unaligned_be16(pwfd_info->wfd_device_type |
					   WFD_DEVINFO_WSD |
					   WFD_DEVINFO_HDCP_SUPPORT,
					   wfdie + wfdielen);
		}

	}

	wfdielen += 2;

	/*	Value2: */
	/*	Session Management Control Port */
	/*	Default TCP port for RTSP messages is 554 */
	put_unaligned_be16(pwfd_info->rtsp_ctrlport, wfdie + wfdielen);
	wfdielen += 2;

	/*	Value3: */
	/*	WFD Device Maximum Throughput */
	/*	300Mbps is the maximum throughput */
	put_unaligned_be16(300, wfdie + wfdielen);
	wfdielen += 2;

	/*	Associated BSSID ATTR */
	/*	Type: */
	wfdie[ wfdielen++ ] = WFD_ATTR_ASSOC_BSSID;

	/*	Length: */
	/*	Note: In the WFD specification, the size of length field is 2. */
	put_unaligned_be16(0x0006, wfdie + wfdielen);
	wfdielen += 2;

	/*	Value: */
	/*	Associated BSSID */
	if (check_fwstate(pmlmepriv, _FW_LINKED) == true)
	{
		memcpy(wfdie + wfdielen, &pmlmepriv->assoc_bssid[ 0 ], ETH_ALEN);
	}
	else
	{
		memset(wfdie + wfdielen, 0x00, ETH_ALEN);
	}

	wfdielen += ETH_ALEN;

	/*	Coupled Sink Information ATTR */
	/*	Type: */
	wfdie[ wfdielen++ ] = WFD_ATTR_COUPLED_SINK_INFO;

	/*	Length: */
	/*	Note: In the WFD specification, the size of length field is 2. */
	put_unaligned_be16(0x0007, wfdie + wfdielen);
	wfdielen += 2;

	/*	Value: */
	/*	Coupled Sink Status bitmap */
	/*	Not coupled/available for Coupling */
	wfdie[ wfdielen++ ] = 0;
	/*   MAC Addr. */
	wfdie[ wfdielen++ ] = 0;
	wfdie[ wfdielen++ ] = 0;
	wfdie[ wfdielen++ ] = 0;
	wfdie[ wfdielen++ ] = 0;
	wfdie[ wfdielen++ ] = 0;
	wfdie[ wfdielen++ ] = 0;

	if (rtw_p2p_chk_role(pwdinfo, P2P_ROLE_GO))
	{
		/*	WFD Session Information ATTR */
		/*	Type: */
		wfdie[ wfdielen++ ] = WFD_ATTR_SESSION_INFO;

		/*	Length: */
		/*	Note: In the WFD specification, the size of length field is 2. */
		put_unaligned_be16(0x0000, wfdie + wfdielen);
		wfdielen += 2;

		/*	Todo: to add the list of WFD device info descriptor in WFD group. */

	}

	pbuf = rtw_set_ie23a(pbuf, _VENDOR_SPECIFIC_IE_, wfdielen, (unsigned char *) wfdie, &len);

	return len;
}

u32 build_assoc_req_wfd_ie(struct wifidirect_info *pwdinfo, u8 *pbuf)
{
	u8 wfdie[ MAX_WFD_IE_LEN] = { 0x00 };
	u32 len = 0, wfdielen = 0;
	struct rtw_adapter					*padapter = NULL;
	struct mlme_priv			*pmlmepriv = NULL;
	struct wifi_display_info		*pwfd_info = NULL;

	/*	WFD OUI */
	if (rtw_p2p_chk_state(pwdinfo, P2P_STATE_NONE) || rtw_p2p_chk_state(pwdinfo, P2P_STATE_IDLE))
	{
		return 0;
	}

	padapter = pwdinfo->padapter;
	pmlmepriv = &padapter->mlmepriv;
	pwfd_info = padapter->wdinfo.wfd_info;

	wfdielen = 0;
	wfdie[ wfdielen++ ] = 0x50;
	wfdie[ wfdielen++ ] = 0x6F;
	wfdie[ wfdielen++ ] = 0x9A;
	wfdie[ wfdielen++ ] = 0x0A;	/*	WFA WFD v1.0 */

	/*	Commented by Albert 20110812 */
	/*	According to the WFD Specification, the probe request frame should contain 4 WFD attributes */
	/*	1. WFD Device Information */
	/*	2. Associated BSSID */
	/*	3. Coupled Sink Information */

	/*	WFD Device Information ATTR */
	/*	Type: */
	wfdie[ wfdielen++ ] = WFD_ATTR_DEVICE_INFO;

	/*	Length: */
	/*	Note: In the WFD specification, the size of length field is 2. */
	put_unaligned_be16(0x0006, wfdie + wfdielen);
	wfdielen += 2;

	/*	Value1: */
	/*	WFD device information */
	/*	WFD primary sink + available for WFD session + WiFi Direct mode + WSD (WFD Service Discovery) */
	put_unaligned_be16(pwfd_info->wfd_device_type |
			   WFD_DEVINFO_SESSION_AVAIL |
			   WFD_DEVINFO_WSD, wfdie + wfdielen);
	wfdielen += 2;

	/*	Value2: */
	/*	Session Management Control Port */
	/*	Default TCP port for RTSP messages is 554 */
	put_unaligned_be16(pwfd_info->rtsp_ctrlport, wfdie + wfdielen);
	wfdielen += 2;

	/*	Value3: */
	/*	WFD Device Maximum Throughput */
	/*	300Mbps is the maximum throughput */
	put_unaligned_be16(300, wfdie + wfdielen);
	wfdielen += 2;

