torvalds/linux/drivers/staging/rtl8723au/core/rtw_p2p.c
					len = (sizeof(psta->secdev_types_list)<(num_of_secdev_type*8)) ? (sizeof(psta->secdev_types_list)) : (num_of_secdev_type*8);

					memcpy(psta->secdev_types_list, pattr_content, len);

					pattr_content += (num_of_secdev_type*8);
				}

				/* dev_name_len = attr_contentlen - ETH_ALEN - 2 - 8 - 1 - (num_of_secdev_type*8); */
				psta->dev_name_len = 0;
				if (WPS_ATTR_DEVICE_NAME == be16_to_cpu(*(u16*)pattr_content))
				{
					dev_name_len = be16_to_cpu(*(u16*)(pattr_content+2));

					psta->dev_name_len = (sizeof(psta->dev_name)<dev_name_len) ? sizeof(psta->dev_name):dev_name_len;

					memcpy(psta->dev_name, pattr_content+4, psta->dev_name_len);
				}

				kfree(pbuf);

			}

		}

		/* Get the next P2P IE */
		p2p_ie = rtw_get_p2p_ie23a(p2p_ie+p2p_ielen, ies_len -(p2p_ie -ies + p2p_ielen), NULL, &p2p_ielen);

	}

	return status_code;
}

u32 process_p2p_devdisc_req23a(struct wifidirect_info *pwdinfo, u8 *pframe,
			    uint len)
{
	u8 *frame_body;
	u8 status, dialogToken;
	struct sta_info *psta = NULL;
	struct rtw_adapter *padapter = pwdinfo->padapter;
	struct sta_priv *pstapriv = &padapter->stapriv;
	u8 *p2p_ie;
	u32	p2p_ielen = 0;
	struct ieee80211_hdr *hdr = (struct ieee80211_hdr *) pframe;

	frame_body = (unsigned char *)
		(pframe + sizeof(struct ieee80211_hdr_3addr));

	dialogToken = frame_body[7];
	status = P2P_STATUS_FAIL_UNKNOWN_P2PGROUP;

	if ((p2p_ie = rtw_get_p2p_ie23a(frame_body + _PUBLIC_ACTION_IE_OFFSET_,
				     len - _PUBLIC_ACTION_IE_OFFSET_, NULL,
				     &p2p_ielen))) {
		u8 groupid[38] = { 0x00 };
		u8 dev_addr[ETH_ALEN] = { 0x00 };
		u32 attr_contentlen = 0;

		if (rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen,
					     P2P_ATTR_GROUP_ID, groupid,
					     &attr_contentlen)) {
			if (!memcmp(pwdinfo->device_addr, groupid, ETH_ALEN) &&
			    !memcmp(pwdinfo->p2p_group_ssid, groupid + ETH_ALEN,
				    pwdinfo->p2p_group_ssid_len)) {
				attr_contentlen = 0;

				if (rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen,
							     P2P_ATTR_DEVICE_ID,
							     dev_addr,
							     &attr_contentlen)) {
					struct list_head *phead, *plist, *ptmp;

					spin_lock_bh(&pstapriv->asoc_list_lock);
					phead = &pstapriv->asoc_list;

					list_for_each_safe(plist, ptmp, phead) {
						psta = container_of(plist, struct sta_info, asoc_list);

						if (psta->is_p2p_device && (psta->dev_cap&P2P_DEVCAP_CLIENT_DISCOVERABILITY) &&
						   !memcmp(psta->dev_addr, dev_addr, ETH_ALEN))
						{
							/* spin_unlock_bh(&pstapriv->asoc_list_lock); */
							/* issue GO Discoverability Request */
							issue_group_disc_req(pwdinfo, psta->hwaddr);
							/* spin_lock_bh(&pstapriv->asoc_list_lock); */
							status = P2P_STATUS_SUCCESS;
							break;
						} else {
							status = P2P_STATUS_FAIL_INFO_UNAVAILABLE;
						}
					}
					spin_unlock_bh(&pstapriv->asoc_list_lock);
				} else {
					status = P2P_STATUS_FAIL_INVALID_PARAM;
				}
			} else {
				status = P2P_STATUS_FAIL_INVALID_PARAM;
			}
		}
	}

	/* issue Device Discoverability Response */
	issue_p2p_devdisc_resp(pwdinfo, hdr->addr2, status, dialogToken);

	return (status == P2P_STATUS_SUCCESS) ? true:false;
}

u32 process_p2p_devdisc_resp23a(struct wifidirect_info *pwdinfo, u8 *pframe, uint len)
{
	return true;
}

u8 process_p2p_provdisc_req23a(struct wifidirect_info *pwdinfo,
			    u8 *pframe, uint len)
{
	u8 *frame_body;
	u8 *wpsie;
	u8 *ptr = NULL;
	uint	wps_ielen = 0, attr_contentlen = 0;
	u16	uconfig_method = 0;
	struct ieee80211_hdr *hdr = (struct ieee80211_hdr *)pframe;

	frame_body = (pframe + sizeof(struct ieee80211_hdr_3addr));

	wpsie = rtw_get_wps_ie23a(frame_body + _PUBLIC_ACTION_IE_OFFSET_,
			       len - _PUBLIC_ACTION_IE_OFFSET_, NULL,
			       &wps_ielen);
	if (!wpsie)
		goto out;

	if (!rtw_get_wps_attr_content23a(wpsie, wps_ielen, WPS_ATTR_CONF_METHOD,
				     (u8 *)&uconfig_method, &attr_contentlen))
		goto out;

	uconfig_method = be16_to_cpu(uconfig_method);
	ptr = pwdinfo->rx_prov_disc_info.strconfig_method_desc_of_prov_disc_req;

	switch (uconfig_method)
	{
	case WPS_CM_DISPLYA:
		memcpy(ptr, "dis", 3);
		break;

	case WPS_CM_LABEL:
		memcpy(ptr, "lab", 3);
		break;

	case WPS_CM_PUSH_BUTTON:
		memcpy(ptr, "pbc", 3);
		break;

	case WPS_CM_KEYPAD:
		memcpy(ptr, "pad", 3);
		break;
	}
	issue_p2p_provision_resp(pwdinfo, hdr->addr2, frame_body,
				 uconfig_method);

out:
	DBG_8723A("[%s] config method = %s\n", __func__, ptr);

	return true;
}

u8 process_p2p_provdisc_resp23a(struct wifidirect_info *pwdinfo,  u8 *pframe)
{

	return true;
}

static u8 rtw_p2p_get_peer_ch_list(struct wifidirect_info *pwdinfo, u8 *ch_content, u8 ch_cnt, u8 *peer_ch_list)
{
	u8 i = 0, j = 0;
	u8 temp = 0;
	u8 ch_no = 0;
	ch_content += 3;
	ch_cnt -= 3;

	while(ch_cnt > 0)
	{
		ch_content += 1;
		ch_cnt -= 1;
		temp = *ch_content;
		for (i = 0 ; i < temp ; i++, j++)
		{
			peer_ch_list[j] = *(ch_content + 1 + i);
		}
		ch_content += (temp + 1);
		ch_cnt -= (temp + 1);
		ch_no += temp ;
	}

	return ch_no;
}

static u8 rtw_p2p_ch_inclusion(struct mlme_ext_priv *pmlmeext, u8 *peer_ch_list, u8 peer_ch_num, u8 *ch_list_inclusioned)
{
	int	i = 0, j = 0, temp = 0;
	u8 ch_no = 0;

	for (i = 0; i < peer_ch_num; i++)
	{
		for (j = temp; j < pmlmeext->max_chan_nums; j++)
		{
			if (*(peer_ch_list + i) == pmlmeext->channel_set[ j ].ChannelNum)
			{
				ch_list_inclusioned[ ch_no++ ] = *(peer_ch_list + i);
				temp = j;
				break;
			}
		}
	}

	return ch_no;
}

u8 process_p2p_group_negotation_req23a(struct wifidirect_info *pwdinfo, u8 *pframe, uint len)
{
	struct rtw_adapter *padapter = pwdinfo->padapter;
	u8	result = P2P_STATUS_SUCCESS;
	u32	p2p_ielen = 0, wps_ielen = 0;
	u8 * ies;
	u32 ies_len;
	u8 *p2p_ie;
	u8 *wpsie;
	u16		wps_devicepassword_id = 0x0000;
	uint	wps_devicepassword_id_len = 0;
#ifdef CONFIG_8723AU_P2P
	u8	wfd_ie[ 128 ] = { 0x00 };
	u32	wfd_ielen = 0;
#endif /*  CONFIG_8723AU_P2P */

	if ((wpsie = rtw_get_wps_ie23a(pframe + _PUBLIC_ACTION_IE_OFFSET_, len - _PUBLIC_ACTION_IE_OFFSET_, NULL, &wps_ielen)))
	{
		/*	Commented by Kurt 20120113 */
		/*	If some device wants to do p2p handshake without sending prov_disc_req */
		/*	We have to get peer_req_cm from here. */
		if (!memcmp(pwdinfo->rx_prov_disc_info.strconfig_method_desc_of_prov_disc_req, "000", 3))
		{
			rtw_get_wps_attr_content23a(wpsie, wps_ielen, WPS_ATTR_DEVICE_PWID, (u8*) &wps_devicepassword_id, &wps_devicepassword_id_len);
			wps_devicepassword_id = be16_to_cpu(wps_devicepassword_id);

