torvalds/linux/drivers/staging/rtl8723au/core/rtw_p2p.c
	}

#ifdef CONFIG_8723AU_P2P
	/*	Added by Albert 20111122 */
	/*	Try to get the TCP port information when receiving the negotiation response. */
	if (rtw_get_wfd_ie(pframe + _PUBLIC_ACTION_IE_OFFSET_, len - _PUBLIC_ACTION_IE_OFFSET_, wfd_ie, &wfd_ielen))
	{
		u8	attr_content[ 10 ] = { 0x00 };
		u32	attr_contentlen = 0;

		DBG_8723A("[%s] WFD IE Found!!\n", __func__);
		rtw_get_wfd_attr_content(wfd_ie, wfd_ielen, WFD_ATTR_DEVICE_INFO, attr_content, &attr_contentlen);
		if (attr_contentlen)
		{
			pwdinfo->wfd_info->peer_rtsp_ctrlport = get_unaligned_be16(attr_content + 2);
			DBG_8723A("[%s] Peer PORT NUM = %d\n", __func__, pwdinfo->wfd_info->peer_rtsp_ctrlport);
		}
	}
#endif /*  CONFIG_8723AU_P2P */

	return result;
}

u8 process_p2p_group_negotation_confirm23a(struct wifidirect_info *pwdinfo, u8 *pframe, uint len)
{
	u8 * ies;
	u32 ies_len;
	u8 * p2p_ie;
	u32	p2p_ielen = 0;
	u8	result = P2P_STATUS_SUCCESS;
	ies = pframe + _PUBLIC_ACTION_IE_OFFSET_;
	ies_len = len - _PUBLIC_ACTION_IE_OFFSET_;

	p2p_ie = rtw_get_p2p_ie23a(ies, ies_len, NULL, &p2p_ielen);
	while (p2p_ie)	/*	Found the P2P IE. */
	{
		u8	attr_content = 0x00, operatingch_info[5] = { 0x00 };
		u8	groupid[ 38 ] = { 0x00 };
		u32	attr_contentlen = 0;

		pwdinfo->negotiation_dialog_token = 1;
		rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen, P2P_ATTR_STATUS, &attr_content, &attr_contentlen);
		if (attr_contentlen == 1)
		{
			DBG_8723A("[%s] Status = %d\n", __func__, attr_content);
			result = attr_content;

			if (attr_content == P2P_STATUS_SUCCESS)
			{
				del_timer_sync(&pwdinfo->restore_p2p_state_timer);

				/*	Commented by Albert 20100911 */
				/*	Todo: Need to handle the case which both Intents are the same. */
				rtw_p2p_set_state(pwdinfo, P2P_STATE_GONEGO_OK);
				rtw_p2p_set_pre_state(pwdinfo, P2P_STATE_GONEGO_OK);
				if ((pwdinfo->intent) > (pwdinfo->peer_intent >> 1))
				{
					rtw_p2p_set_role(pwdinfo, P2P_ROLE_GO);
				}
				else if ((pwdinfo->intent) < (pwdinfo->peer_intent >> 1))
				{
					rtw_p2p_set_role(pwdinfo, P2P_ROLE_CLIENT);
				}
				else
				{
					/*	Have to compare the Tie Breaker */
					if (pwdinfo->peer_intent & 0x01)
					{
						rtw_p2p_set_role(pwdinfo, P2P_ROLE_CLIENT);
					}
					else
					{
						rtw_p2p_set_role(pwdinfo, P2P_ROLE_GO);
					}
				}
			}
			else
			{
				rtw_p2p_set_role(pwdinfo, P2P_ROLE_DEVICE);
				rtw_p2p_set_state(pwdinfo, P2P_STATE_GONEGO_FAIL);
				break;
			}
		}

		/*	Try to get the group id information */
		attr_contentlen = 0;
		memset(groupid, 0x00, 38);
		if (rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen, P2P_ATTR_GROUP_ID, groupid, &attr_contentlen))
		{
			DBG_8723A("[%s] Ssid = %s, ssidlen = %zu\n", __func__, &groupid[ETH_ALEN], strlen(&groupid[ETH_ALEN]));
			memcpy(pwdinfo->groupid_info.go_device_addr, &groupid[0], ETH_ALEN);
			memcpy(pwdinfo->groupid_info.ssid, &groupid[6], attr_contentlen - ETH_ALEN);
		}

		attr_contentlen = 0;
		if (rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen, P2P_ATTR_OPERATING_CH, operatingch_info, &attr_contentlen))
		{
			DBG_8723A("[%s] Peer's operating channel = %d\n", __func__, operatingch_info[4]);
			pwdinfo->peer_operating_ch = operatingch_info[4];
		}

		/* Get the next P2P IE */
		p2p_ie = rtw_get_p2p_ie23a(p2p_ie+p2p_ielen, ies_len -(p2p_ie -ies + p2p_ielen), NULL, &p2p_ielen);

	}

	return result;
}

u8 process_p2p_presence_req23a(struct wifidirect_info *pwdinfo, u8 *pframe, uint len)
{
	u8 *frame_body;
	u8 dialogToken = 0;
	u8 status = P2P_STATUS_SUCCESS;
	struct ieee80211_hdr *hdr = (struct ieee80211_hdr *) pframe;

	frame_body = (unsigned char *)(pframe + sizeof(struct ieee80211_hdr_3addr));

	dialogToken = frame_body[6];

	/* todo: check NoA attribute */

	issue_p2p_presence_resp(pwdinfo, hdr->addr2, status, dialogToken);

	return true;
}

static void find_phase_handler(struct rtw_adapter *padapter)
{
	struct wifidirect_info  *pwdinfo = &padapter->wdinfo;
	struct mlme_priv		*pmlmepriv = &padapter->mlmepriv;
	struct cfg80211_ssid ssid;
	u8					_status = 0;



	memset((unsigned char*)&ssid, 0, sizeof(struct cfg80211_ssid));
	memcpy(ssid.ssid, pwdinfo->p2p_wildcard_ssid, P2P_WILDCARD_SSID_LEN);
	ssid.ssid_len = P2P_WILDCARD_SSID_LEN;

	rtw_p2p_set_state(pwdinfo, P2P_STATE_FIND_PHASE_SEARCH);

	spin_lock_bh(&pmlmepriv->lock);
	_status = rtw_sitesurvey_cmd23a(padapter, &ssid, 1, NULL, 0);
	spin_unlock_bh(&pmlmepriv->lock);


}

void p2p_concurrent_handler(struct rtw_adapter* padapter);

static void restore_p2p_state_handler(struct rtw_adapter *padapter)
{
	struct wifidirect_info  *pwdinfo = &padapter->wdinfo;

	if (rtw_p2p_chk_state(pwdinfo, P2P_STATE_GONEGO_ING) || rtw_p2p_chk_state(pwdinfo, P2P_STATE_GONEGO_FAIL))
		rtw_p2p_set_role(pwdinfo, P2P_ROLE_DEVICE);

	rtw_p2p_set_state(pwdinfo, rtw_p2p_pre_state(pwdinfo));

	if (rtw_p2p_chk_role(pwdinfo, P2P_ROLE_DEVICE)) {
		/*	In the P2P client mode, the driver should not switch back to its listen channel */
		/*	because this P2P client should stay at the operating channel of P2P GO. */
		set_channel_bwmode23a(padapter, pwdinfo->listen_channel, HAL_PRIME_CHNL_OFFSET_DONT_CARE, HT_CHANNEL_WIDTH_20);
	}
}

static void pre_tx_invitereq_handler(struct rtw_adapter *padapter)
{
	struct wifidirect_info  *pwdinfo = &padapter->wdinfo;

	set_channel_bwmode23a(padapter, pwdinfo->invitereq_info.peer_ch, HAL_PRIME_CHNL_OFFSET_DONT_CARE, HT_CHANNEL_WIDTH_20);
	rtl8723a_mlme_sitesurvey(padapter, 1);
	issue23a_probereq_p2p(padapter, NULL);
	mod_timer(&pwdinfo->pre_tx_scan_timer,
		  jiffies + msecs_to_jiffies(P2P_TX_PRESCAN_TIMEOUT));
}

static void pre_tx_provdisc_handler(struct rtw_adapter *padapter)
{
	struct wifidirect_info  *pwdinfo = &padapter->wdinfo;

	set_channel_bwmode23a(padapter,
			      pwdinfo->tx_prov_disc_info.peer_channel_num[0],
			      HAL_PRIME_CHNL_OFFSET_DONT_CARE,
			      HT_CHANNEL_WIDTH_20);
	rtl8723a_mlme_sitesurvey(padapter, 1);
	issue23a_probereq_p2p(padapter, NULL);
	mod_timer(&pwdinfo->pre_tx_scan_timer,
		  jiffies + msecs_to_jiffies(P2P_TX_PRESCAN_TIMEOUT));
}

static void pre_tx_negoreq_handler(struct rtw_adapter *padapter)
{
	struct wifidirect_info  *pwdinfo = &padapter->wdinfo;

	set_channel_bwmode23a(padapter,
			      pwdinfo->nego_req_info.peer_channel_num[0],
			      HAL_PRIME_CHNL_OFFSET_DONT_CARE,
			      HT_CHANNEL_WIDTH_20);
	rtl8723a_mlme_sitesurvey(padapter, 1);
	issue23a_probereq_p2p(padapter, NULL);
	mod_timer(&pwdinfo->pre_tx_scan_timer,
		  jiffies + msecs_to_jiffies(P2P_TX_PRESCAN_TIMEOUT));
}

static void ro_ch_handler(struct rtw_adapter *padapter)
{
	struct cfg80211_wifidirect_info *pcfg80211_wdinfo = &padapter->cfg80211_wdinfo;
	struct wifidirect_info *pwdinfo = &padapter->wdinfo;
	struct mlme_ext_priv *pmlmeext = &padapter->mlmeextpriv;

