torvalds/linux/drivers/staging/rtl8723au/core/rtw_p2p.c
	if (pcfg80211_wdinfo->restore_channel != pmlmeext->cur_channel) {
		if (!check_fwstate(&padapter->mlmepriv, _FW_LINKED))
			pmlmeext->cur_channel = pcfg80211_wdinfo->restore_channel;

		set_channel_bwmode23a(padapter, pmlmeext->cur_channel,
				      HAL_PRIME_CHNL_OFFSET_DONT_CARE,
				      HT_CHANNEL_WIDTH_20);
	}

	rtw_p2p_set_state(pwdinfo, rtw_p2p_pre_state(pwdinfo));

	pcfg80211_wdinfo->is_ro_ch = false;

	DBG_8723A("cfg80211_remain_on_channel_expired\n");

	rtw_cfg80211_remain_on_channel_expired(padapter,
		pcfg80211_wdinfo->remain_on_ch_cookie,
		&pcfg80211_wdinfo->remain_on_ch_channel,
		pcfg80211_wdinfo->remain_on_ch_type, GFP_KERNEL);
}

static void ro_ch_timer_process (unsigned long data)
{
	struct rtw_adapter *adapter = (struct rtw_adapter *)data;

	p2p_protocol_wk_cmd23a(adapter, P2P_RO_CH_WK);
}

#ifdef CONFIG_8723AU_P2P
void rtw_append_wfd_ie(struct rtw_adapter *padapter, u8 *buf, u32* len)
{
	unsigned char	*frame_body;
	u8 category, action, OUI_Subtype, dialogToken = 0;
	u32	wfdielen = 0;

	frame_body = (unsigned char *)(buf + sizeof(struct ieee80211_hdr_3addr));
	category = frame_body[0];

	if (category == WLAN_CATEGORY_PUBLIC) {
		action = frame_body[1];
		if (action == ACT_PUBLIC_VENDOR &&
		    !memcmp(frame_body+2, P2P_OUI23A, 4)) {
			OUI_Subtype = frame_body[6];
			dialogToken = frame_body[7];
			switch (OUI_Subtype)/* OUI Subtype */ {
			case P2P_GO_NEGO_REQ:
				wfdielen = build_nego_req_wfd_ie(&padapter->wdinfo, buf + (*len));
				(*len) += wfdielen;
				break;
			case P2P_GO_NEGO_RESP:
				wfdielen = build_nego_resp_wfd_ie(&padapter->wdinfo, buf + (*len));
				(*len) += wfdielen;
				break;
			case P2P_GO_NEGO_CONF:
				wfdielen = build_nego_confirm_wfd_ie(&padapter->wdinfo, buf + (*len));
				(*len) += wfdielen;
				break;
			case P2P_INVIT_REQ:
				wfdielen = build_invitation_req_wfd_ie(&padapter->wdinfo, buf + (*len));
				(*len) += wfdielen;
				break;
			case P2P_INVIT_RESP:
				wfdielen = build_invitation_resp_wfd_ie(&padapter->wdinfo, buf + (*len));
				(*len) += wfdielen;
				break;
			case P2P_DEVDISC_REQ:
				break;
			case P2P_DEVDISC_RESP:
				break;
			case P2P_PROVISION_DISC_REQ:
				wfdielen = build_provdisc_req_wfd_ie(&padapter->wdinfo, buf + (*len));
				(*len) += wfdielen;
				break;
			case P2P_PROVISION_DISC_RESP:
				wfdielen = build_provdisc_resp_wfd_ie(&padapter->wdinfo, buf + (*len));
				(*len) += wfdielen;
				break;
			default:
				break;
			}
		}
	} else if (category == WLAN_CATEGORY_VENDOR_SPECIFIC) {
		OUI_Subtype = frame_body[5];
		dialogToken = frame_body[6];
	} else {
		DBG_8723A("%s, action frame category =%d\n", __func__, category);
	}
}
#endif

int rtw_p2p_check_frames(struct rtw_adapter *padapter, const u8 *buf, u32 len, u8 tx)
{
	int is_p2p_frame = (-1);
	unsigned char	*frame_body;
	u8 category, action, OUI_Subtype, dialogToken = 0;
	u8 *p2p_ie = NULL;
	uint p2p_ielen = 0;
	struct rtw_wdev_priv *pwdev_priv = wdev_to_priv(padapter->rtw_wdev);

	frame_body = (unsigned char *)(buf + sizeof(struct ieee80211_hdr_3addr));
	category = frame_body[0];
	/* just for check */
	if (category == WLAN_CATEGORY_PUBLIC)
	{
		action = frame_body[1];
		if (action == ACT_PUBLIC_VENDOR &&
		    !memcmp(frame_body+2, P2P_OUI23A, 4)) {
			OUI_Subtype = frame_body[6];
			dialogToken = frame_body[7];
			is_p2p_frame = OUI_Subtype;
			p2p_ie = rtw_get_p2p_ie23a(
				(u8 *)buf+sizeof(struct ieee80211_hdr_3addr)+_PUBLIC_ACTION_IE_OFFSET_,
				len-sizeof(struct ieee80211_hdr_3addr)-_PUBLIC_ACTION_IE_OFFSET_,
				NULL, &p2p_ielen);

			switch (OUI_Subtype) {/* OUI Subtype */
			u8 *cont;
			uint cont_len;
			case P2P_GO_NEGO_REQ:
				DBG_8723A("RTW_%s:P2P_GO_NEGO_REQ, dialogToken =%d\n", (tx == true)?"Tx":"Rx", dialogToken);
				break;
			case P2P_GO_NEGO_RESP:
				cont = rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen, P2P_ATTR_STATUS, NULL, &cont_len);
				DBG_8723A("RTW_%s:P2P_GO_NEGO_RESP, dialogToken =%d, status:%d\n", (tx == true)?"Tx":"Rx", dialogToken, cont?*cont:-1);

				if (!tx)
					pwdev_priv->provdisc_req_issued = false;
				break;
			case P2P_GO_NEGO_CONF:
				cont = rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen, P2P_ATTR_STATUS, NULL, &cont_len);
				DBG_8723A("RTW_%s:P2P_GO_NEGO_CONF, dialogToken =%d, status:%d\n",
					  (tx == true)?"Tx":"Rx", dialogToken, cont?*cont:-1);
				break;
			case P2P_INVIT_REQ:
			{
				struct rtw_wdev_invit_info* invit_info = &pwdev_priv->invit_info;
				int flags = -1;
				int op_ch = 0;

				if ((cont = rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen, P2P_ATTR_INVITATION_FLAGS, NULL, &cont_len)))
					flags = *cont;
				if ((cont = rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen, P2P_ATTR_OPERATING_CH, NULL, &cont_len)))
					op_ch = *(cont+4);

				if (invit_info->token != dialogToken)
					rtw_wdev_invit_info_init(invit_info);

				invit_info->token = dialogToken;
				invit_info->flags = (flags ==-1) ? 0x0 : flags;
				invit_info->req_op_ch = op_ch;

				DBG_8723A("RTW_%s:P2P_INVIT_REQ, dialogToken =%d, flags:0x%02x, op_ch:%d\n",
					  (tx) ? "Tx" : "Rx", dialogToken, flags, op_ch);
				break;
			}
			case P2P_INVIT_RESP:
			{
				struct rtw_wdev_invit_info* invit_info = &pwdev_priv->invit_info;
				int status = -1;
				int op_ch = 0;

				if ((cont = rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen, P2P_ATTR_STATUS, NULL, &cont_len)))
					status = *cont;
				if ((cont = rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen, P2P_ATTR_OPERATING_CH, NULL, &cont_len)))
					op_ch = *(cont+4);

				if (invit_info->token != dialogToken) {
					rtw_wdev_invit_info_init(invit_info);
				} else {
					invit_info->token = 0;
					invit_info->status = (status ==-1) ? 0xff : status;
					invit_info->rsp_op_ch = op_ch;
				}

				DBG_8723A("RTW_%s:P2P_INVIT_RESP, dialogToken =%d, status:%d, op_ch:%d\n",
					  (tx == true)?"Tx":"Rx", dialogToken, status, op_ch);
				break;
			}
			case P2P_DEVDISC_REQ:
				DBG_8723A("RTW_%s:P2P_DEVDISC_REQ, dialogToken =%d\n", (tx == true)?"Tx":"Rx", dialogToken);
				break;
			case P2P_DEVDISC_RESP:
				cont = rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen, P2P_ATTR_STATUS, NULL, &cont_len);
				DBG_8723A("RTW_%s:P2P_DEVDISC_RESP, dialogToken =%d, status:%d\n", (tx == true)?"Tx":"Rx", dialogToken, cont?*cont:-1);
				break;
			case P2P_PROVISION_DISC_REQ:
			{
				size_t frame_body_len = len - sizeof(struct ieee80211_hdr_3addr);
				u8 *p2p_ie;
				uint p2p_ielen = 0;
				uint contentlen = 0;

				DBG_8723A("RTW_%s:P2P_PROVISION_DISC_REQ, dialogToken =%d\n", (tx == true)?"Tx":"Rx", dialogToken);

				pwdev_priv->provdisc_req_issued = false;

				p2p_ie = rtw_get_p2p_ie23a(frame_body + _PUBLIC_ACTION_IE_OFFSET_,
							   frame_body_len - _PUBLIC_ACTION_IE_OFFSET_,
							   NULL, &p2p_ielen);
				if (p2p_ie) {
					if (rtw_get_p2p_attr23a_content(p2p_ie, p2p_ielen, P2P_ATTR_GROUP_ID, NULL, &contentlen))
						pwdev_priv->provdisc_req_issued = false;/* case: p2p_client join p2p GO */
					else
						pwdev_priv->provdisc_req_issued = true;/* case: p2p_devices connection before Nego req. */
				}
			}
				break;
			case P2P_PROVISION_DISC_RESP:
				DBG_8723A("RTW_%s:P2P_PROVISION_DISC_RESP, dialogToken =%d\n", (tx == true)?"Tx":"Rx", dialogToken);
				break;
			default:
				DBG_8723A("RTW_%s:OUI_Subtype =%d, dialogToken =%d\n", (tx == true)?"Tx":"Rx", OUI_Subtype, dialogToken);
				break;
			}

